In [2]:
import pandas as pd

In [3]:
df_movies = pd.read_csv("IMDb movies.csv", low_memory=False)
df_ratings = pd.read_csv("IMDb ratings.csv")

In [4]:
# select columns 
df_movies = df_movies[["imdb_title_id", "title", "year", "genre", "country"]]

In [5]:
df_ratings = df_ratings[["imdb_title_id", "total_votes", "mean_vote"]]

# 1. merge()

In [6]:
df1 = pd.DataFrame({'id': ['A', 'B', 'C', 'D'],
                    'age': [30, 23, 25, 22]})
df1

  id  age
0  A   30
1  B   23
2  C   25
3  D   22

In [7]:
df2 = pd.DataFrame({'id': ['C', 'D', 'E', 'F'],
                    'job': ['Doctor', 'Statistician',
                            'Accountant', 'Developer']})
df2

  id           job
0  C        Doctor
1  D  Statistician
2  E    Accountant
3  F     Developer

## 1.1. Inner Join

In [8]:
df_inner_join = df1.merge(df2, on="id", how="inner")

In [9]:
df2.merge(df1, on="id", how= "inner")

  id           job  age
0  C        Doctor   25
1  D  Statistician   22

In [10]:
print(df1.shape)
print(df2.shape)
print(df_inner_join.shape)

(4, 2)
(4, 2)
(2, 3)

### Exercise

In [11]:
# merge df_movies and df_ratings (inner join)
df_movies.merge(df_ratings, on= "imdb_title_id", how = "inner")

# '''another method to merge these two dataframe.'''
# pd.merge(df_movies, df_ratings, on='imdb_title_id')

,imdb_title_id,title,year,genre,country,total_votes,mean_vote
0,tt0000009,Miss Jerry,1894,Romance,USA,154,5.9
1,tt0000574,The Story of the Kelly Gang,1906,"Biography, Crime, Drama",Australia,589,6.3
2,tt0001892,Den sorte drøm,1911,Drama,"Germany, Denmark",188,6.0
3,tt0002101,Cleopatra,1912,"Drama, History",USA,446,5.3
4,tt0002130,L'Inferno,1911,"Adventure, Drama, Fantasy",Italy,2237,6.9
...,...,...,...,...,...,...,...
85850,tt9908390,Le lion,2020,Comedy,"France, Belgium",398,5.5
85851,tt9911196,De Beentjes van Sint-Hildegard,2020,"Comedy, Drama",Netherlands,724,7.9
85852,tt9911774,Padmavyuhathile Abhimanyu,2019,Drama,India,265,7.8
85853,tt9914286,Sokagin Çocuklari,2019,"Drama, Family",Turkey,194,9.4
85854,tt9914942,La vida sense la Sara Amat,2019,Drama,Spain,102,6.8

# 2. Full Join (outer join)

In [12]:
df1

  id  age
0  A   30
1  B   23
2  C   25
3  D   22

In [13]:
df2

  id           job
0  C        Doctor
1  D  Statistician
2  E    Accountant
3  F     Developer

In [14]:
df_outer_join = df1.merge(df2, on= "id", how= "outer")
df_outer_join

  id   age           job
0  A  30.0           NaN
1  B  23.0           NaN
2  C  25.0        Doctor
3  D  22.0  Statistician
4  E   NaN    Accountant
5  F   NaN     Developer

In [15]:
# shape
print(df_outer_join.shape)
print(df1.shape)
print(df2.shape)

(6, 3)
(4, 2)
(4, 2)

### Exercise

In [16]:
# merge df_movies and df_ratings (outer join)
df_movies.merge(df_ratings, on="imdb_title_id", how="outer")

,imdb_title_id,title,year,genre,country,total_votes,mean_vote
0,tt0000009,Miss Jerry,1894,Romance,USA,154,5.9
1,tt0000574,The Story of the Kelly Gang,1906,"Biography, Crime, Drama",Australia,589,6.3
2,tt0001892,Den sorte drøm,1911,Drama,"Germany, Denmark",188,6.0
3,tt0002101,Cleopatra,1912,"Drama, History",USA,446,5.3
4,tt0002130,L'Inferno,1911,"Adventure, Drama, Fantasy",Italy,2237,6.9
...,...,...,...,...,...,...,...
85850,tt9908390,Le lion,2020,Comedy,"France, Belgium",398,5.5
85851,tt9911196,De Beentjes van Sint-Hildegard,2020,"Comedy, Drama",Netherlands,724,7.9
85852,tt9911774,Padmavyuhathile Abhimanyu,2019,Drama,India,265,7.8
85853,tt9914286,Sokagin Çocuklari,2019,"Drama, Family",Turkey,194,9.4
85854,tt9914942,La vida sense la Sara Amat,2019,Drama,Spain,102,6.8

## Exclusive - Full Join

In [17]:
df1.merge(df2, on= "id", how= "outer", indicator = True)

  id   age           job      _merge
0  A  30.0           NaN   left_only
1  B  23.0           NaN   left_only
2  C  25.0        Doctor        both
3  D  22.0  Statistician        both
4  E   NaN    Accountant  right_only
5  F   NaN     Developer  right_only

In [18]:
df1.merge(df2, on= "id", how= "outer", indicator = True).query("_merge == 'right_only' or _merge == 'left_only'")

  id   age         job      _merge
0  A  30.0         NaN   left_only
1  B  23.0         NaN   left_only
4  E   NaN  Accountant  right_only
5  F   NaN   Developer  right_only

### Exercise

In [19]:
# merge df_movies and df_ratings (FULL Join, without Exclusive)
df_movies.merge(df_ratings, on = "imdb_title_id", how= "outer", indicator= True)

,imdb_title_id,title,year,genre,country,total_votes,mean_vote,_merge
0,tt0000009,Miss Jerry,1894,Romance,USA,154,5.9,both
1,tt0000574,The Story of the Kelly Gang,1906,"Biography, Crime, Drama",Australia,589,6.3,both
2,tt0001892,Den sorte drøm,1911,Drama,"Germany, Denmark",188,6.0,both
3,tt0002101,Cleopatra,1912,"Drama, History",USA,446,5.3,both
4,tt0002130,L'Inferno,1911,"Adventure, Drama, Fantasy",Italy,2237,6.9,both
...,...,...,...,...,...,...,...,...
85850,tt9908390,Le lion,2020,Comedy,"France, Belgium",398,5.5,both
85851,tt9911196,De Beentjes van Sint-Hildegard,2020,"Comedy, Drama",Netherlands,724,7.9,both
85852,tt9911774,Padmavyuhathile Abhimanyu,2019,Drama,India,265,7.8,both
85853,tt9914286,Sokagin Çocuklari,2019,"Drama, Family",Turkey,194,9.4,both
85854,tt9914942,La vida sense la Sara Amat,2019,Drama,Spain,102,6.8,both

In [20]:
df_movies.nunique()

imdb_title_id    85855
title            82094
year               113
genre             1257
country           4907
dtype: int64

In [21]:
# TO make it exclusive full join, we must add .query()
df_movies.merge(df_ratings, on = "imdb_title_id", how= "outer", indicator= True).query("_merge == 'right_only' or _merge == 'left_only'")

Empty DataFrame
Columns: [imdb_title_id, title, year, genre, country, total_votes, mean_vote, _merge]
Index: []

## Left Join

In [22]:
df1

  id  age
0  A   30
1  B   23
2  C   25
3  D   22

In [23]:
df2

  id           job
0  C        Doctor
1  D  Statistician
2  E    Accountant
3  F     Developer

In [24]:
df1.merge(df2, on= "id", how= "left")

  id  age           job
0  A   30           NaN
1  B   23           NaN
2  C   25        Doctor
3  D   22  Statistician

## Exercise

In [28]:
# extract a 50% sampel of the df_movies dataframe
df_movies_sample = df_movies.sample(frac=0.5)
df_movies_sample

,imdb_title_id,title,year,genre,country
61656,tt1754332,Paappi Appachaa,2010,"Comedy, Drama",India
1609,tt0024262,Il piccolo gigante re dei gangsters,1933,"Comedy, Crime, Romance",USA
50549,tt0833501,El menor de los males,2007,"Comedy, Thriller",Spain
42957,tt0348333,Waiting...,2005,Comedy,USA
23824,tt0094940,Ragazzo chiamato Dakota,1988,Drama,USA
...,...,...,...,...,...
2987,tt0030190,L'alfabeto dell'amore,1938,"Comedy, Musical, Romance",USA
39782,tt0278527,Karateci Kiz,1973,"Action, Crime, Drama",Turkey
84304,tt8469890,En las buenas y en las malas,2019,"Comedy, Romance",Mexico
641,tt0018910,Quattro mura,1928,Drama,USA
74399,tt4331718,The Messenger's Box,2015,Drama,USA

In [29]:
df_movies

,imdb_title_id,title,year,genre,country
0,tt0000009,Miss Jerry,1894,Romance,USA
1,tt0000574,The Story of the Kelly Gang,1906,"Biography, Crime, Drama",Australia
2,tt0001892,Den sorte drøm,1911,Drama,"Germany, Denmark"
3,tt0002101,Cleopatra,1912,"Drama, History",USA
4,tt0002130,L'Inferno,1911,"Adventure, Drama, Fantasy",Italy
...,...,...,...,...,...
85850,tt9908390,Le lion,2020,Comedy,"France, Belgium"
85851,tt9911196,De Beentjes van Sint-Hildegard,2020,"Comedy, Drama",Netherlands
85852,tt9911774,Padmavyuhathile Abhimanyu,2019,Drama,India
85853,tt9914286,Sokagin Çocuklari,2019,"Drama, Family",Turkey
85854,tt9914942,La vida sense la Sara Amat,2019,Drama,Spain

In [35]:
# merge df_movies_sample and df_ratings (left join)
df_merge_left = df_movies_sample.merge(df_ratings, on= "imdb_title_id", how="left")
df_merge_left

,imdb_title_id,title,year,genre,country,total_votes,mean_vote
0,tt1754332,Paappi Appachaa,2010,"Comedy, Drama",India,185,5.1
1,tt0024262,Il piccolo gigante re dei gangsters,1933,"Comedy, Crime, Romance",USA,1109,7.1
2,tt0833501,El menor de los males,2007,"Comedy, Thriller",Spain,175,6.6
3,tt0348333,Waiting...,2005,Comedy,USA,87658,7.0
4,tt0094940,Ragazzo chiamato Dakota,1988,Drama,USA,230,5.1
...,...,...,...,...,...,...,...
42923,tt0030190,L'alfabeto dell'amore,1938,"Comedy, Musical, Romance",USA,298,6.0
42924,tt0278527,Karateci Kiz,1973,"Action, Crime, Drama",Turkey,341,4.7
42925,tt8469890,En las buenas y en las malas,2019,"Comedy, Romance",Mexico,202,4.6
42926,tt0018910,Quattro mura,1928,Drama,USA,307,7.0
42927,tt4331718,The Messenger's Box,2015,Drama,USA,109,2.9

In [38]:
print(df_movies.shape)
print(df_ratings.shape)
print(df_merge_left.shape)

(85855, 5)
(85855, 3)
(42928, 7)

## Exclusive Left Join

In [40]:
df1

  id  age
0  A   30
1  B   23
2  C   25
3  D   22

In [41]:
df2

  id           job
0  C        Doctor
1  D  Statistician
2  E    Accountant
3  F     Developer

In [39]:
# indicator=True
df1.merge(df2, on='id', how='outer',
          indicator = True)

  id   age           job      _merge
0  A  30.0           NaN   left_only
1  B  23.0           NaN   left_only
2  C  25.0        Doctor        both
3  D  22.0  Statistician        both
4  E   NaN    Accountant  right_only
5  F   NaN     Developer  right_only

In [44]:
# query
df1.merge(df2, on='id', how='outer',
          indicator = True).query("_merge=='left_only'")

  id   age  job     _merge
0  A  30.0  NaN  left_only
1  B  23.0  NaN  left_only

## Exercise

In [51]:
# make a copy of the df_movies dataframe
df_movies_2 = df_movies.copy()

In [58]:
# set the first 1000 values of "imdb_title_id" as column as 'tt1234567890'
df_movies_2[:1000] = "tt1234567890"
df_movies_2.head(10)

  imdb_title_id         title          year         genre       country
0  tt1234567890  tt1234567890  tt1234567890  tt1234567890  tt1234567890
1  tt1234567890  tt1234567890  tt1234567890  tt1234567890  tt1234567890
2  tt1234567890  tt1234567890  tt1234567890  tt1234567890  tt1234567890
3  tt1234567890  tt1234567890  tt1234567890  tt1234567890  tt1234567890
4  tt1234567890  tt1234567890  tt1234567890  tt1234567890  tt1234567890
5  tt1234567890  tt1234567890  tt1234567890  tt1234567890  tt1234567890
6  tt1234567890  tt1234567890  tt1234567890  tt1234567890  tt1234567890
7  tt1234567890  tt1234567890  tt1234567890  tt1234567890  tt1234567890
8  tt1234567890  tt1234567890  tt1234567890  tt1234567890  tt1234567890
9  tt1234567890  tt1234567890  tt1234567890  tt1234567890  tt1234567890

In [59]:
# to know the shapes
print(df_movies_2.shape)
print(df_ratings.shape)

(85855, 5)
(85855, 3)

In [60]:
# merge df_movies and df_ratings (exclusive left join)
df_ex_left = df_movies_2.merge(df_ratings, on="imdb_title_id", how="outer",
                             indicator=True).query("_merge == 'left_only'")

In [61]:
df_ex_left

,imdb_title_id,title,year,genre,country,total_votes,mean_vote,_merge
55817,tt1234567890,tt1234567890,tt1234567890,tt1234567890,tt1234567890,NaN,NaN,left_only
55818,tt1234567890,tt1234567890,tt1234567890,tt1234567890,tt1234567890,NaN,NaN,left_only
55819,tt1234567890,tt1234567890,tt1234567890,tt1234567890,tt1234567890,NaN,NaN,left_only
55820,tt1234567890,tt1234567890,tt1234567890,tt1234567890,tt1234567890,NaN,NaN,left_only
55821,tt1234567890,tt1234567890,tt1234567890,tt1234567890,tt1234567890,NaN,NaN,left_only
...,...,...,...,...,...,...,...,...
56812,tt1234567890,tt1234567890,tt1234567890,tt1234567890,tt1234567890,NaN,NaN,left_only
56813,tt1234567890,tt1234567890,tt1234567890,tt1234567890,tt1234567890,NaN,NaN,left_only
56814,tt1234567890,tt1234567890,tt1234567890,tt1234567890,tt1234567890,NaN,NaN,left_only
56815,tt1234567890,tt1234567890,tt1234567890,tt1234567890,tt1234567890,NaN,NaN,left_only
56816,tt1234567890,tt1234567890,tt1234567890,tt1234567890,tt1234567890,NaN,NaN,left_only

In [66]:
print(df_movies_2.shape)
print(df_ratings.shape)
print(df_ex_left.shape)

(85855, 5)
(85855, 3)
(1000, 8)

## Right Join

In [68]:
df1.merge(df2, on= "id", how= "right")

  id   age           job
0  C  25.0        Doctor
1  D  22.0  Statistician
2  E   NaN    Accountant
3  F   NaN     Developer

## Exercise

In [69]:
# extract a 30% sample of the df_ratings dataframe
df_ratings_sample = df_ratings.sample(frac= 0.3)
df_ratings_sample

      imdb_title_id  total_votes  mean_vote
48270     tt0472259         3771        6.2
16864     tt0072596          187        5.8
40222     tt0285175        18024        5.6
58704     tt1499201         6117        6.1
78509     tt5720136          148        6.7
...             ...          ...        ...
57130     tt1337366         4066        6.5
13344     tt0062518         1015        7.2
935       tt0021152          422        4.9
46454     tt0430308        43477        5.4
69719     tt3075360         2156        7.9

[25756 rows x 3 columns]

In [73]:
# merge df_movies and df_ratings (right join)
df_merge_right = df_movies_2.merge(df_ratings_sample, on= "imdb_title_id", 
                                   how= "right")
df_merge_right

,imdb_title_id,title,year,genre,country,total_votes,mean_vote
0,tt0472259,Alone with Her,2006,"Crime, Drama, Thriller",USA,3771,6.2
1,tt0072596,Aaron Loves Angela,1975,"Comedy, Drama, Romance",USA,187,5.8
2,tt0285175,Havoc - Fuori controllo,2005,"Crime, Drama","USA, Germany",18024,5.6
3,tt1499201,Anjaana Anjaani,2010,"Comedy, Drama, Musical",India,6117,6.1
4,tt5720136,Sawal 700 Crore Dollar Ka,2016,"Action, Crime",Pakistan,148,6.7
...,...,...,...,...,...,...,...
25751,tt1337366,Nokas,2010,"Action, Biography, Crime",Norway,4066,6.5
25752,tt0062518,Zatôichi rôyaburi,1967,"Action, Adventure, Drama",Japan,1015,7.2
25753,tt0021152,NaN,NaN,NaN,NaN,422,4.9
25754,tt0430308,Get Rich or Die Tryin',2005,"Biography, Crime, Drama","USA, Canada",43477,5.4
25755,tt3075360,Googly,2013,"Comedy, Romance",India,2156,7.9

In [76]:
# what is the shape of the new dataframe?
print(df_movies.shape)
print(df_ratings_sample.shape)
print(df_merge_right.shape)

(85855, 5)
(25756, 3)
(25756, 7)

## Exclusive Right Join

In [109]:
# indicator=True
df1.merge(df2, on='id', how='outer',
          indicator = True)

  id   age           job      _merge
0  A  30.0           NaN   left_only
1  B  23.0           NaN   left_only
2  C  25.0        Doctor        both
3  D  22.0  Statistician        both
4  E   NaN    Accountant  right_only
5  F   NaN     Developer  right_only

In [110]:
# query
df1.merge(df2, on='id', how='outer',
          indicator = True).query("_merge=='right_only'")

  id  age         job      _merge
4  E  NaN  Accountant  right_only
5  F  NaN   Developer  right_only

## Exercise

In [111]:
# make a copy of the df_ratings dataframe
df_ratings_2 = df_ratings.copy()

In [112]:
# set the first 1000 values of 'imdb_title_id' column as 'tt1234567890'
for index in df_ratings_2.index:
    if index < 1000:
        df_ratings_2.loc[index, 'imdb_title_id'] = 'tt1234567890'

In [113]:
df_ratings_2.head()

  imdb_title_id  total_votes  mean_vote
0  tt1234567890          154        5.9
1  tt1234567890          589        6.3
2  tt1234567890          188        6.0
3  tt1234567890          446        5.3
4  tt1234567890         2237        6.9

In [114]:
# merge df_movies and df_ratings_2 (exclusive right join)
df_exclusive_right = df_movies.merge(df_ratings_2,
                                     on='imdb_title_id',
                                     how='outer', 
                                     indicator=True).query("_merge=='right_only'")

In [115]:
df_exclusive_right

Empty DataFrame
Columns: [imdb_title_id, title, year, genre, country, total_votes, mean_vote, _merge]
Index: []

In [116]:
# shape
print(df_movies.shape)
print(df_ratings_2.shape)
print(df_exclusive_right.shape)

(85855, 5)
(85855, 3)
(0, 8)